In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
data = {
    "Nume": ["Alina", "Bobby", "Cristi"],
    "Varsta": [19, 22, 33],
    "Gen": ["F", "B", "B"],
    "Salariu": [2000, 3000, 40000]
}

df = pd.DataFrame(data)
df

     Nume  Varsta Gen  Salariu
0   Alina      19   F     2000
1   Bobby      22   B     3000
2  Cristi      33   B    40000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nume     3 non-null      object
 1   Varsta   3 non-null      int64
 2   Gen      3 non-null      object
 3   Salariu  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [5]:
df.describe()

          Varsta       Salariu
count   3.000000      3.000000
mean   24.666667  15000.000000
std     7.371115  21656.407828
min    19.000000   2000.000000
25%    20.500000   2500.000000
50%    22.000000   3000.000000
75%    27.500000  21500.000000
max    33.000000  40000.000000

In [6]:
type(df["Nume"])

pandas.core.series.Series

In [7]:
df["Nume"]

0     Alina
1     Bobby
2    Cristi
Name: Nume, dtype: object

In [8]:
df.Nume

0     Alina
1     Bobby
2    Cristi
Name: Nume, dtype: object

In [11]:
df.Salariu

0     2000
1     3000
2    40000
Name: Salariu, dtype: int64

In [14]:
df[["Nume", "Gen"]]

     Nume Gen
0   Alina   F
1   Bobby   B
2  Cristi   B

In [15]:
df

     Nume  Varsta Gen  Salariu
0   Alina      19   F     2000
1   Bobby      22   B     3000
2  Cristi      33   B    40000

In [18]:
df.loc[1, "Varsta"]

np.int64(22)

In [20]:
df["Nume"] == "Alina"

0     True
1    False
2    False
Name: Nume, dtype: bool

In [21]:
df[df["Nume"] == "Alina"]

    Nume  Varsta Gen  Salariu
0  Alina      19   F     2000

In [22]:
df[df["Salariu"] == df["Salariu"].max()]

     Nume  Varsta Gen  Salariu
2  Cristi      33   B    40000

In [28]:
df.sort_values("Nume", ascending = False)

     Nume  Varsta Gen  Salariu
2  Cristi      33   B    40000
1   Bobby      22   B     3000
0   Alina      19   F     2000

In [29]:
df.rename(columns={"Gen": "Sex"})

     Nume  Varsta Sex  Salariu
0   Alina      19   F     2000
1   Bobby      22   B     3000
2  Cristi      33   B    40000

In [30]:
df

     Nume  Varsta Gen  Salariu
0   Alina      19   F     2000
1   Bobby      22   B     3000
2  Cristi      33   B    40000

In [31]:
df.rename(columns={"Gen": "Sex"}, inplace = True)

In [32]:
df

     Nume  Varsta Sex  Salariu
0   Alina      19   F     2000
1   Bobby      22   B     3000
2  Cristi      33   B    40000

In [33]:
df.T

             0      1       2
Nume     Alina  Bobby  Cristi
Varsta      19     22      33
Sex          F      B       B
Salariu   2000   3000   40000

In [34]:
df["Salariu"].apply(lambda x:x * 2)

0     4000
1     6000
2    80000
Name: Salariu, dtype: int64

In [35]:
df

     Nume  Varsta Sex  Salariu
0   Alina      19   F     2000
1   Bobby      22   B     3000
2  Cristi      33   B    40000

In [36]:
df["Salariu Dublat"] = df["Salariu"].apply(lambda x:x * 2)

In [37]:
df

     Nume  Varsta Sex  Salariu  Salariu Dublat
0   Alina      19   F     2000            4000
1   Bobby      22   B     3000            6000
2  Cristi      33   B    40000           80000

In [45]:
df["Gen"] = df["Sex"].apply(lambda x: "Feminin" if x == "F" else "Masculin")
df

     Nume  Varsta Sex  Salariu  Salariu Dublat       Gen
0   Alina      19   F     2000            4000   Feminin
1   Bobby      22   B     3000            6000  Masculin
2  Cristi      33   B    40000           80000  Masculin

In [43]:
df["Gen"] = df["Sex"].map({"F": "Feminin", "M": "Masculin"})
df

     Nume  Varsta Sex  Salariu  Salariu Dublat      Gen
0   Alina      19   F     2000            4000  Feminin
1   Bobby      22   B     3000            6000      NaN
2  Cristi      33   B    40000           80000      NaN